[
  {
    "id": 301,
    "text": "Forward Kinematics berechnet die Gelenkwinkel aus der Endposition.",
    "correct": false,
    "explanation": "Forward Kinematics berechnet die Endposition aus gegebenen Gelenkwinkeln – nicht umgekehrt."
  },
  {
    "id": 302,
    "text": "Der Kalman-Filter wird in der mobilen Robotik zur Lokalisierung eingesetzt.",
    "correct": true,
    "explanation": "Der Kalman-Filter kombiniert Vorhersage und Sensordaten, um die Position eines Roboters zu schätzen."
  },
  {
    "id": 303,
    "text": "Sensorfusion ist für SLAM irrelevant.",
    "correct": false,
    "explanation": "Sensorfusion ist essenziell für SLAM, um verschiedene Sensordaten zu integrieren und Unsicherheit zu berücksichtigen."
  },
  {
    "id": 304,
    "text": "Objekterkennung gehört zu den typischen Wahrnehmungsaufgaben eines Roboters.",
    "correct": true,
    "explanation": "Wahrnehmung umfasst u.a. Objekterkennung, Lokalisierung und Umgebungserfassung."
  },
  {
    "id": 305,
    "text": "ROS1 unterstützt Echtzeitkommunikation und ist moderner als ROS2.",
    "correct": false,
    "explanation": "ROS2 basiert auf DDS und unterstützt echte Parallelität und Echtzeit – damit moderner als ROS1."
  },
  {
    "id": 306,
    "text": "Hyperparameter im Reinforcement Learning haben keinen Einfluss auf das Lernen.",
    "correct": false,
    "explanation": "Hyperparameter wie Lernrate und Epsilon steuern das Lernverhalten und beeinflussen Qualität und Geschwindigkeit."
  },
  {
    "id": 307,
    "text": "RViz ist ein Tool zur Visualisierung von Roboterdaten in ROS.",
    "correct": true,
    "explanation": "RViz stellt z. B. Lidar-Scans, Kartierung und Navigation grafisch dar – sehr hilfreich beim Debuggen."
  },
  {
    "id": 308,
    "text": "Der Global Planner in ROS berechnet lokale Bewegungen.",
    "correct": false,
    "explanation": "Der Global Planner plant Pfade auf globaler Ebene, der Local Planner ist für lokale Bewegungen zuständig."
  },
  {
    "id": 309,
    "text": "Die Perception-Action-Schleife beschreibt die Kopplung von Wahrnehmung und Handlung.",
    "correct": true,
    "explanation": "Ein Roboter nimmt Informationen auf und reagiert entsprechend – diese Rückkopplung ist zentral in der Robotik."
  },
  {
    "id": 310,
    "text": "Das 'Uncanny Valley' beschreibt ein besonders vertrauenswürdiges Verhalten von Robotern.",
    "correct": false,
    "explanation": "Das 'Uncanny Valley' beschreibt die Ablehnung zu menschenähnlicher, aber nicht perfekter Robotik."
  },
  {
    "id": 311,
    "text": "Ein Affordance beschreibt, welche Funktionen ein Objekt anbietet.",
    "correct": true,
    "explanation": "Affordances sind Hinweise auf Nutzungsmöglichkeiten, die ein Objekt durch Form oder Aussehen vermittelt."
  },
  {
    "id": 312,
    "text": "Ein TurtleBot hat typischerweise keinen Lidar-Sensor.",
    "correct": false,
    "explanation": "Ein TurtleBot besitzt normalerweise einen Lidar-Sensor für Navigation und Mapping."
  },
  {
    "id": 313,
    "text": "Fehler beim TurtleBot-Setup entstehen häufig durch falsche Netzwerkkonfigurationen.",
    "correct": true,
    "explanation": "Netzwerkprobleme, falsche Pfade und Versionen sind häufige Ursachen für Setup-Fehler."
  },
  {
    "id": 314,
    "text": "Bei Deep Learning mit Bilddaten ist eine große Datenmenge unwichtig.",
    "correct": false,
    "explanation": "Deep Learning erfordert große, vielfältige Datensätze und sorgfältige Vorverarbeitung, um sinnvoll zu lernen."
  },
  {
    "id": 315,
    "text": "Neuronale Netze in der Objekterkennung arbeiten mit Merkmalsextraktion und Klassifikation.",
    "correct": true,
    "explanation": "Sie erkennen Muster im Bild und ordnen sie vortrainierten Klassen zu – z. B. mit CNNs."
  },
  {
    "id": 316,
    "text": "NLP ist für soziale Roboter unwichtig.",
    "correct": false,
    "explanation": "NLP ist grundlegend, um menschliche Sprache zu verstehen und sinnvoll zu antworten."
  },
  {
    "id": 317,
    "text": "TTS-Systeme ermöglichen emotional gefärbte Sprachausgabe bei Robotern.",
    "correct": true,
    "explanation": "Über Tonhöhe, Lautstärke und Rhythmus kann Sprachsynthese emotional angepasst werden."
  },
  {
    "id": 318,
    "text": "Pick-and-Place ist eine einfache Form der Objektverfolgung.",
    "correct": false,
    "explanation": "Pick-and-Place bezieht sich auf gezieltes Greifen und Ablegen, nicht auf kontinuierliches Verfolgen."
  },
  {
    "id": 319,
    "text": "Bewegung, Sprache und Mimik sind relevante Interaktionsformen in der HRI.",
    "correct": true,
    "explanation": "Diese Kanäle sind für die intuitive und glaubwürdige Mensch-Roboter-Kommunikation entscheidend."
  },
  {
    "id": 320,
    "text": "Eine gute Roboterpersönlichkeit ist empathisch, konsistent und anwendungsbezogen.",
    "correct": true,
    "explanation": "Die Persönlichkeit eines Roboters sollte zur Anwendung passen und positive Interaktion fördern."
  }
]