[
  {
    "id": 517,
    "text": "Was beschreibt die Kinematik in der Robotik und wie grenzt sie sich von der Dynamik ab?",
    "answer": "Kinematik beschreibt die Bewegung von Robotern ohne Berücksichtigung von Kräften. Die Dynamik hingegen bezieht Kräfte und Momente mit ein."
  },
  {
    "id": 518,
    "text": "Welche Gelenktypen kommen in Robotern vor und wie unterscheiden sie sich?",
    "answer": "Es gibt hauptsächlich Rotationsgelenke (revolute joints) für Drehbewegungen und translatorische Gelenke (prismatische joints) für lineare Bewegungen."
  },
  {
    "id": 519,
    "text": "Was versteht man unter Freiheitsgraden eines Roboters und wie viele sind typisch?",
    "answer": "Ein Freiheitsgrad (DoF) ist eine unabhängige Bewegungsmöglichkeit. Typische Roboterarme haben 6 Freiheitsgrade."
  },
  {
    "id": 520,
    "text": "Was beschreibt der Konfigurationsraum (C-Space) eines Roboters?",
    "answer": "Der C-Space ist die Menge aller möglichen Konfigurationen eines Roboters, meist definiert durch seine Gelenkwinkel."
  },
  {
    "id": 521,
    "text": "Was versteht man unter dem Arbeitsraum eines Roboters?",
    "answer": "Der Arbeitsraum ist der Bereich im Raum, den der Endeffektor eines Roboters erreichen kann."
  },
  {
    "id": 522,
    "text": "Wie unterscheidet sich der Task Space vom Konfigurationsraum?",
    "answer": "Der Task Space ist der physische Raum, in dem der Roboter arbeitet, während der C-Space die möglichen Zustände des Roboters beschreibt."
  },
  {
    "id": 523,
    "text": "Welche Rolle spielen Transformationen in der Robotik?",
    "answer": "Transformationen beschreiben Lage und Orientierung von Koordinatensystemen relativ zueinander."
  },
  {
    "id": 524,
    "text": "Was sind DH-Parameter und wozu werden sie verwendet?",
    "answer": "DH-Parameter sind ein standardisiertes System zur Beschreibung der Geometrie von Roboterarmen."
  },
  {
    "id": 525,
    "text": "Wie funktioniert die Vorwärtskinematik?",
    "answer": "Bei der Vorwärtskinematik wird aus den Gelenkwinkeln die Position des Endeffektors berechnet."
  },
  {
    "id": 526,
    "text": "Wofür wird die Inverse Kinematik verwendet?",
    "answer": "Sie dient dazu, aus einer gewünschten Endeffektorposition die dafür nötigen Gelenkwinkel zu berechnen."
  },
  {
    "id": 527,
    "text": "Wie verknüpft man mehrere Koordinatensysteme bei Robotern?",
    "answer": "Durch sukzessive Anwendung von Transformationsmatrizen."
  },
  {
    "id": 528,
    "text": "Was versteht man unter Lokalisierung bei mobilen Robotern?",
    "answer": "Die Bestimmung der eigenen Position im Raum mittels Sensorik wie Odometrie, GPS, Lidar."
  },
  {
    "id": 529,
    "text": "Welche Aufgabe übernimmt ein Kalman-Filter in der Robotik?",
    "answer": "Er schätzt den Zustand eines Systems aus verrauschten Sensordaten, z. B. Position oder Geschwindigkeit."
  },
  {
    "id": 530,
    "text": "Was ist Sensorfusion und warum ist sie wichtig?",
    "answer": "Sensorfusion kombiniert Informationen aus verschiedenen Sensoren zur robusteren Zustandsschätzung."
  },
  {
    "id": 531,
    "text": "Was misst die Odometrie und welche Schwächen hat sie?",
    "answer": "Odometrie misst Bewegung durch Radrotationen, ist aber anfällig für Drift."
  },
  {
    "id": 532,
    "text": "Welche Schritte umfasst die Navigation eines mobilen Roboters?",
    "answer": "Typische Schritte sind: Kartenerstellung, Lokalisierung, Pfadplanung und -verfolgung."
  },
  {
    "id": 533,
    "text": "Welche Sensoren werden zur Umgebungserfassung genutzt?",
    "answer": "Übliche Sensoren sind Lidar, Kamera, IMU, GPS und Ultraschall."
  }
]